Revit 2027 API
ExternalGeometryId.IsValidExternalGeometryId Method
 Checks whether a given string represents a valid ExternalGeometryId or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidExternalGeometryId(
	string externalGeometryId
)
Public Shared Function IsValidExternalGeometryId (
	externalGeometryId As String
) As Boolean
public:
static bool IsValidExternalGeometryId(
	String^ externalGeometryId
)
static member IsValidExternalGeometryId :
        externalGeometryId : string -> bool
Parameters
externalGeometryId String
 A string that represents an identifier for an external geometry.
Return Value
Boolean
 True if the string represents a valid ExternalGeometryId, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Any non-empty string is a valid ExternalGeometryId.
See Also
Reference
ExternalGeometryId Class
Autodesk.Revit.DB Namespace